public/man/man1/tload.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - tload.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - tload.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>tload - graphic representation of system load average</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>tload</strong> [/options/] [/tty/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>tload</strong> prints a graph of the current system load average to the
specified <em>tty</em> (or the tty of the <strong>tload</strong> process if none is
specified).</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<dl>
<dt>
<strong>-s</strong>, <strong>–scale</strong> <em>number</em>
</dt>
<dd>The scale option allows a vertical scale
to be specified for the display (in characters between graph ticks);
thus, a smaller value represents a larger scale, and vice versa.</dd>
<dt>
<strong>-d</strong>, <strong>–delay</strong> <em>seconds</em>
</dt>
<dd>The delay sets the delay between graph
updates in <em>seconds</em>.</dd>
<dt>
<strong>-h</strong>, <strong>–help</strong>
</dt>
<dd>Display this help text.</dd>
<dt>
<strong>-V</strong>, <strong>–version</strong>
</dt>
<dd>Display version information and exit.</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FILES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><em>/proc/loadavg</em> load average information</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*ps*(1), *top*(1), *uptime*(1), *w*(1)</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
BUGS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>The *-d*/ delay/ option sets the time argument for an *alarm*(2); if -d
0 is specified, the alarm is set to 0, which will never send the
<strong>SIGALRM</strong> and update the display.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
AUTHORS
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Branko Lankester, <a href="david@ods.com">David Engel</a>,
<a href="johnsonm@redhat.com">Michael K. Johnson</a>.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
REPORTING BUGS
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>Please send bug reports to <a href="procps@freelists.html">procps@freelists.html</a></p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
